# SchemaType Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
NumberingSchema..::..SchemaType Property
NumberingSchema Class See Also
---
Identifies the kind of elements/objects this numbering schema is used for.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public NumberingSchemaType SchemaType { get; }
```

Visual Basic
---
```text
Public ReadOnly Property SchemaType As NumberingSchemaType
	Get
```

Visual C++
---
```text
public:
property NumberingSchemaType^ SchemaType {
	NumberingSchemaType^ get ();
}
```

# See Also
NumberingSchema Class
Autodesk.Revit.DB Namespace